{"speakers":[{"id":"d76229725545bd69dc7b3b4f69c70163ed61d3c6","name":"Mark Aufflick","photo":"https://s.gravatar.com/avatar/c3169e7f4c83e81188794c7f146a6b3e?s=80","url":"http://altconf.com/17/speakers/d76229725545bd69dc7b3b4f69c70163ed61d3c6","organization":null,"position":null,"biography":"Mark provides software R&D and other consulting services with The High Technology Bureau. He is the convenor of Sydney CocoaHeads, the chair of YOW!Connected Conference, and has been involved with many other meet ups and conferences. Over his grey hair inducing career he has worked across a wide range of sectors including medical devices, banking, retail, and management consulting.","sessions":[{"id":"d76229725545bd69dc7b3b4f69c70163ed61d3c6","title":"The Future of Tech is Sustainable, Diverse & Makes a Difference"}],"links":[]},{"id":"412887d8745ae26852c7c4e5bff6278b21adb0e2","name":"Mohammad Azam","photo":"https://s.gravatar.com/avatar/675b8938a8ed82f09c48e58dd3bdf2c3?s=80","url":"http://altconf.com/17/speakers/412887d8745ae26852c7c4e5bff6278b21adb0e2","organization":null,"position":null,"biography":"Mohammad Azam is an iOS Instructor at The Iron Yard. Before joining The Iron Yard, Azam served as a senior mobile developer at Blinds.com, A Home Depot company. Azam led the mobile team at Blinds.com to develop the Home Depot blinds/shades online experience. Previously, Azam has worked as a team lead for many large companies including Schlumberger, Baker Hughes, AIG and VALIC.\n\nAzam has also published 8-10 personal apps to the App Store, including Vegetable Tree – Gardening Guide which was featured by Apple as the best gardening app in the App Store. Azam is also active on YouTube and maintains his popular channel “AzamSharp” where he shares his iOS knowledge. Azam is also a Udemy instructor where he has published courses on “Swift 2.0” and “iOS MapKit Development Using Swift Language”.\n\nAzam also frequently contributes iOS articles to the Code Magazine and talks at different iOS conferences all around the country. Before entering the iOS community Azam was an active member of the Microsoft .NET community. Azam was also awarded Microsoft MVP award due to his contributions in the .NET community.\n\nWhen not developing iOS applications Azam likes to spend time with his family and plan his next trip to the unknown corners of the world.","sessions":[{"id":"412887d8745ae26852c7c4e5bff6278b21adb0e2","title":"Taming the Massive Controllers"}],"links":[]},{"id":"b1aa5fea14cab8ecd41a05484abfa64788a4b505","name":"Alicia Carr","photo":null,"url":"http://altconf.com/17/speakers/b1aa5fea14cab8ecd41a05484abfa64788a4b505","organization":null,"position":null,"biography":"Alicia is the first woman of color mobile developer to create a domestic violence app (PEOV) dedicated to helping victims escape abuse. She used her acquired skills as a developer to make a difference. Alicia is also Director of Women Who Code Atlanta she dedicated to empowering women in tech with Women Who Code, she has receive major acknowledgement from Apple at WWDC15 and WWDC16 you could find her on the Apple new beginnings video.","sessions":[{"id":"b1aa5fea14cab8ecd41a05484abfa64788a4b505","title":"Is it too late to learn how to program and how being a developer change my life"}],"links":[]},{"id":"af5efcfa025c908062b65c7f0b9cb2be3c6e9b18","name":"Leah Culver","photo":"https://s.gravatar.com/avatar/5573f0b3cbe983ae0f2d00a2e610d6be?s=80","url":"http://altconf.com/17/speakers/af5efcfa025c908062b65c7f0b9cb2be3c6e9b18","organization":null,"position":null,"biography":"Leah is the Co-founder and CTO of Breaker, a new podcast listening app focused on social discovery. She's also an author of the OAuth and oEmbed open API specifications and loves user-friendly APIs and Swift guard statements.","sessions":[{"id":"af5efcfa025c908062b65c7f0b9cb2be3c6e9b18","title":"Kickstarting your app with user feedback"}],"links":[]},{"id":"0ee1d277b04879f0ba6263598d9e2f10f94e98f8","name":"Jessica Dennis","photo":"https://s.gravatar.com/avatar/b224c4c782119f2e0c71f80344c841ac?s=80","url":"http://altconf.com/17/speakers/0ee1d277b04879f0ba6263598d9e2f10f94e98f8","organization":null,"position":null,"biography":"Jessica Dennis is a front-end web developer and podcast who in Schenectady, NY of all places. She likes regular expressions more than she should and has written a shameful amount of JavaScript.","sessions":[{"id":"0ee1d277b04879f0ba6263598d9e2f10f94e98f8","title":"It's Ok, No One Knows Anything"}],"links":[]},{"id":"dbe1765f11b96bd6f443c763a0782be085b5878b","name":"Steven Gray","photo":null,"url":"http://altconf.com/17/speakers/dbe1765f11b96bd6f443c763a0782be085b5878b","organization":null,"position":null,"biography":"Steven started programming on Apple hardware at an early age when his grandfather brought home an early-model Apple ][ computer to explore during summer holiday. These days Steven leads a team of elite software consultants in the Silicon Forest of Portland, Oregon. His current focus is on the Internet of Things and how best to apply lessons learned from years of mobile development to the rapidly emerging and evolving technologies of the IoT.","sessions":[{"id":"dbe1765f11b96bd6f443c763a0782be085b5878b","title":"Swift Things: Programming the Internet of Things with Swift"}],"links":[]},{"id":"c8c36a3ae648da44213ca8e9098b99dce10895f4","name":"Tripta Gupta","photo":"https://s.gravatar.com/avatar/2f2928bcd00f2f0e4b95495bf7ae984b?s=80","url":"http://altconf.com/17/speakers/c8c36a3ae648da44213ca8e9098b99dce10895f4","organization":null,"position":null,"biography":"I am an iOS software engineer at Capital One in San Francisco. I like to be at the intersection of technology, business, and creativity. Hobbies that I’m passionate about are endurance running (half-marathons all the way!), supporting diversity and inclusion, and storytelling as a medium to create resonance with people.\n\nSoon after Swift became open source, I moved to the backend-services team at Capital One in order to explore the use of building production-ready services in Swift. This project required me to take a nascent technology to production, which meant assessing the business goals and implementing against Swift as a platform to enable our business and streamline our development process.\n\nI’ve gained a lot of perspective, both as a general technologist and as a client-first engineer, and am looking forward to sharing my learnings with the audience.","sessions":[{"id":"c8c36a3ae648da44213ca8e9098b99dce10895f4","title":"Enterprise Swift Services: A Recipe for Deployment into Production"}],"links":[]},{"id":"1be81fbb73902881a44e40563a29e50f7d1d004a","name":"Stephen Hackett","photo":"https://s.gravatar.com/avatar/01cc7774ae336ae339241d79d93d34da?s=80","url":"http://altconf.com/17/speakers/1be81fbb73902881a44e40563a29e50f7d1d004a","organization":null,"position":null,"biography":"Co-founder of the Relay FM podcast network and writer at 512 Pixels","sessions":[{"id":"1be81fbb73902881a44e40563a29e50f7d1d004a","title":"The Reality of Indie Life"}],"links":[]},{"id":"188a677bbd2e5b24b41be96ca8f5fe8ad85c1e63","name":"Greg Heo","photo":"https://s.gravatar.com/avatar/06609d73ad2165c4aafcf65a1ddb9563?s=80","url":"http://altconf.com/17/speakers/188a677bbd2e5b24b41be96ca8f5fe8ad85c1e63","organization":null,"position":null,"biography":"Greg is an iOS and Swift nerd living in sunny San Francisco. He spends his days working at Instagram hand-cropping those square photos, and his nights wading through the Swift repositories and writing about his findings at swiftunboxed.com.","sessions":[{"id":"188a677bbd2e5b24b41be96ca8f5fe8ad85c1e63","title":"Thirteen Ways Of Looking At A View Controller"}],"links":[]},{"id":"0afb082526308768b0fc96b6183e1151e792c973","name":"Meghan Kane","photo":"https://s.gravatar.com/avatar/f0e8b612728c334392f7c11eaf2f1405?s=80","url":"http://altconf.com/17/speakers/0afb082526308768b0fc96b6183e1151e792c973","organization":null,"position":null,"biography":"Meghan is a software engineer at SoundCloud in Berlin, focusing mostly on iOS development. She has a background in Math & CS (MIT, 2012).\n\nShe is passionate about encouraging people to learn to code and breaking down barriers of entry to the world of programming. When not coding, Meghan can usually be found cycling, building bicycles, or playing board games.","sessions":[{"id":"0afb082526308768b0fc96b6183e1151e792c973","title":"Bringing Machine Learning to your iOS Apps 🤖📲"}],"links":[]},{"id":"d2bb8a8ab787ea7dcbeb04db17995f5db73c2511","name":"Todd Kerpelman","photo":"https://s.gravatar.com/avatar/8e42d1b3a58e20619f74d00c55405eff?s=80","url":"http://altconf.com/17/speakers/d2bb8a8ab787ea7dcbeb04db17995f5db73c2511","organization":null,"position":null,"biography":"Todd Kerpelman used to be a halfway decent game designer, until he tricked Google into hiring him on as a Developer Advocate, and now he spends his time making YouTube videos about Firebase stuff. He figures it's just a matter of time until they discover he doesn't know what he's talking about, so he's stockpiling snacks in the meantime.","sessions":[{"id":"d2bb8a8ab787ea7dcbeb04db17995f5db73c2511","title":"How to Make Your App Better with A/B Testing on Firebase"}],"links":[]},{"id":"f4fe312e75aeaa4d8e92f9dfa62df202bf7d6207","name":"Guanshan Liu","photo":"https://s.gravatar.com/avatar/7f6340ec47f2f9585427311992653654?s=80","url":"http://altconf.com/17/speakers/f4fe312e75aeaa4d8e92f9dfa62df202bf7d6207","organization":null,"position":null,"biography":"I'm an iOS developer working at Booking.com in Shanghai. I'm also the organize of CocoaHeads Shanghai meetup. I love making apps, playing video games and I'm a big fan of Chelsea FC.","sessions":[{"id":"f4fe312e75aeaa4d8e92f9dfa62df202bf7d6207","title":"Make Your Apps China-Friendly"}],"links":[]},{"id":"c52b61d07890714a952194436cc05a17b276d6a0","name":"James Majors","photo":"https://s.gravatar.com/avatar/df6b8dfb3aa870227944b2517ea3f3c9?s=80","url":"http://altconf.com/17/speakers/c52b61d07890714a952194436cc05a17b276d6a0","organization":null,"position":null,"biography":"After spending 25 years in the audio and video world I decided that I needed a change so I went back to one of my first passions, writing software.  I was fortunate enough join the team at POSSIBLE Mobile where I get the chance to write apps people use and occasionally talk at conferences.\n","sessions":[{"id":"c52b61d07890714a952194436cc05a17b276d6a0","title":"What making Records taught me about writing code"}],"links":[]},{"id":"e7d75f0a1db1e091c9e963b2f532e446a22b4022","name":"Ian Partridge","photo":"https://s.gravatar.com/avatar/29bb4c32d7b3ec323be870138222bce8?s=80","url":"http://altconf.com/17/speakers/e7d75f0a1db1e091c9e963b2f532e446a22b4022","organization":null,"position":null,"biography":"Ian Partridge is a senior developer in Swift@IBM, working to bring Swift to the cloud on Linux.\n \nOne of the original authors of the garbage collector in IBM's Java Virtual Machine, he has a background in enterprise runtime technologies - including memory management, debugging, performance tuning, and analysis - across a wide range of operating systems.\n \nSince joining Swift@IBM he has made multiple contributions to swift.org projects (including work on Grand Central Dispatch and Foundation), and also worked on bringing the Kitura web framework to its 1.0 release. He is currently leading the team making Foundation on Linux ready for production usage in the IBM Cloud.","sessions":[{"id":"e7d75f0a1db1e091c9e963b2f532e446a22b4022","title":"By Zeus! Become an Application God with Serverless Swift"}],"links":[]},{"id":"cd84e7ed0255efd67250a0ab6367044044fb75f1","name":"Simina Pasat","photo":"https://s.gravatar.com/avatar/f5d3c9dd2427efa4ca103ee17635af95?s=80","url":"http://altconf.com/17/speakers/cd84e7ed0255efd67250a0ab6367044044fb75f1","organization":null,"position":null,"biography":"Co-Speaker: Luke Kim\n\nSimina Pasat is a Program Manager for Visual Studio Mobile Center and passionate about building a product that mobile developers love. She’s worked on HockeyApp, and is now applying her skills to growing Mobile Center’s build service and making sure it’s easy for all developers to use. Before joining the mobile DevOps space, Simina was a Program Manager for Xbox Live, where she gained valuable consumer services and market insights.","sessions":[{"id":"cd84e7ed0255efd67250a0ab6367044044fb75f1","title":"Continuous everything  for iOS apps"}],"links":[]},{"id":"c102a51373dbaf7fb42f2410cf818cda379d0f29","name":"Virginia Roberts","photo":"https://s.gravatar.com/avatar/1fa33af65a867183e66b98cf90e23312?s=80","url":"http://altconf.com/17/speakers/c102a51373dbaf7fb42f2410cf818cda379d0f29","organization":null,"position":null,"biography":"Virginia Roberts is a Program Manager at Microsoft who focuses on customer relationships and engagement. In her free time she works to make STEM fields more diverse. She worked for a decade as an online dating coach, helping people demystify everything from eHarmony to Tinder. Virginia always has snacks to spare if you need a blood sugar boost.\n\n(Note to AltConf organizers—I've already been in touch with John and had requested the Thursday after lunch time slot to match my travel plans. Thanks!)","sessions":[{"id":"c102a51373dbaf7fb42f2410cf818cda379d0f29","title":"Name your thing! (Subject to change)"}],"links":[]},{"id":"03273d7c303cd6caa5a45a1fea46332ccab6c33d","name":"Clément SAUVAGE","photo":null,"url":"http://altconf.com/17/speakers/03273d7c303cd6caa5a45a1fea46332ccab6c33d","organization":null,"position":null,"biography":"Engaged in iOS development since iPhone OS ß, Clement is engaged in start-up world since 2008, he's actually CTO of Les Tontons Livreurs, an exciting on demand moving service company in France & EU, and time-to-time speaker & angel investor.","sessions":[{"id":"03273d7c303cd6caa5a45a1fea46332ccab6c33d","title":"A app for a presidential election !"}],"links":[]},{"id":"6fce9ab0caba096f65444543364b8e63c30111c2","name":"Mada Seghete","photo":null,"url":"http://altconf.com/17/speakers/6fce9ab0caba096f65444543364b8e63c30111c2","organization":null,"position":null,"biography":"Mada leads community and developer marketing and is one of the co-founders of Branch, a deep linking and mobile metrics company. In the last year, Branch has grown a 22,000-person Mobile Growth community in 53 cities globally and now powers deep linking for over 15,000 apps and 2 billion monthly users around the world. Born and raised in Romania, Mada came to the US to study Electrical and Computer Engineering at Cornell University and then earned her Masters of Engineering and MBA from Stanford. Mada enjoys playing the latest viral mobile game, binge watching the hottest sci-fi show and photographing Branch events. She was included in Linkedin’s Next Wave, 150 top professionals in 15 industries all 35 & under and sits on the board of the App Developer’s Alliance.","sessions":[{"id":"6fce9ab0caba096f65444543364b8e63c30111c2","title":"Mastering Mobile SEO for Your Website & Native App"}],"links":[]},{"id":"5196e70c12c00ac22440b7dee6ce4b91cd31cf18","name":"Sal Soghoian","photo":null,"url":"http://altconf.com/17/speakers/5196e70c12c00ac22440b7dee6ce4b91cd31cf18","organization":null,"position":null,"biography":"Sal Soghoian is a user automation expert, software developer, author and musician. The principles represented in his credo, “the power of the computer should reside in the hands of the one using it,” are manifest throughout his professional career.\n\nHe served as the Product Manager of Automation Technologies for Apple Inc. from 1997 through 2016, advancing AppleScript, Automator, JavaScript for Automation (JXA), System Services, the Terminal, Apple Configurator, and the other macOS automation tools, and furthered support by writing the scripting dictionaries for iWork, iPhoto, Aperture and Photos, and writing the “Mastered for iTunes” automation tools.\n\nSal designed and wrote the user automation support in the Apple Configurator application, which uses macOS automation to manage iOS device deployment. He also wrote the book “AppleScript 1-2-3,” among countless articles about user automation. Sal is well recognized as a featured presenter/instructor for Quark, Thunder Lizard Productions, Apple, and the Seybold, MacTech, MacSysAdmin, and Macworld conferences.\n\nWhen he’s not empowering with technology, you can find Sal playing jazz guitar. His jazz standards album, “To Be With You,” and his original compositions on “Catwalk” with Blue Indigo, can both be found on iTunes.\n\nAdditional information can be found at <https://en.wikipedia.org/wiki/Sal_Soghoian>","sessions":[{"id":"5196e70c12c00ac22440b7dee6ce4b91cd31cf18","title":"Finally, Automation Magic for both iOS and macOS"}],"links":[]},{"id":"aa9b5ee2c43a021207480d8aeb3fcd25f7f3beb8","name":"Daniel Steinberg","photo":null,"url":"http://altconf.com/17/speakers/aa9b5ee2c43a021207480d8aeb3fcd25f7f3beb8","organization":null,"position":null,"biography":null,"sessions":[{"id":"aa9b5ee2c43a021207480d8aeb3fcd25f7f3beb8","title":"Why the Func"}],"links":[]},{"id":"2bfa00ad9eadb3c394a42c46ee102659e7b22c3e","name":"Yaroslav Stepanenko","photo":null,"url":"http://altconf.com/17/speakers/2bfa00ad9eadb3c394a42c46ee102659e7b22c3e","organization":null,"position":null,"biography":"Product Marketing Manager @MacPaw\n\nPhD, product marketing professional with 8+ years experience in developing and executing marketing strategies.","sessions":[{"id":"2bfa00ad9eadb3c394a42c46ee102659e7b22c3e","title":"Industry Report: Mac Developers Survey Results"}],"links":[]},{"id":"0a932c8c023068606eb22077c844e497274d2794","name":"Kristina Thai","photo":"https://s.gravatar.com/avatar/9455cf8cef7162321b21a354d27f6dba?s=80","url":"http://altconf.com/17/speakers/0a932c8c023068606eb22077c844e497274d2794","organization":null,"position":null,"biography":"Kristina Thai is an iOS Software Engineer at Intuit, where she works on the QuickBooks Self-Employed app. She regularly writes tutorials and technical commentary on iOS and watchOS development on her website kristina.io. As an international speaker, she has presented on topics ranging from Apple Watch development to using technical writing to advance engineering skills. Her past speaking events include talks at AltConf, try! Swift NYC, iOSDevUK and many more. Kristina's main goal in life is to consume as much guacamole as she can. In her spare time she also enjoys watching cat videos and Twittering.","sessions":[{"id":"0a932c8c023068606eb22077c844e497274d2794","title":"Challenging Your Assumptions"}],"links":[]},{"id":"ae8c96c72f478ee12e26dea01f20c2431c84a506","name":"Jeff Verkoeyen","photo":null,"url":"http://altconf.com/17/speakers/ae8c96c72f478ee12e26dea01f20c2431c84a506","organization":null,"position":null,"biography":"Jeff Verkoeyen is a software designer on Google’s Material Design team. His work involves finding patterns and building solutions in service to Google’s 80+ iOS apps in order to make it easier to build higher quality user experiences. Jeff is the engineering lead for Material Motion.","sessions":[{"id":"ae8c96c72f478ee12e26dea01f20c2431c84a506","title":"What Google learned about building smooth animation in our iOS apps"}],"links":[]},{"id":"8836e323d972a8e97304193d0a5be0ffb0becd40","name":"Brian Voong","photo":"https://s.gravatar.com/avatar/b7aedb35fefd3455fbb340ee678fef7e?s=80","url":"http://altconf.com/17/speakers/8836e323d972a8e97304193d0a5be0ffb0becd40","organization":null,"position":null,"biography":"A seasoned iOS developer, with a YouTube channel of 43K subscribers dispensing Swift knowledge as well as soft skills for job searching.  Channel is at https://www.youtube.com/channel/UCuP2vJ6kRutQBfRmdcI92mA.","sessions":[{"id":"8836e323d972a8e97304193d0a5be0ffb0becd40","title":"Build That App"}],"links":[]},{"id":"b07636c7ec0ae25bf0cb2751dd85fb3e8654b443","name":"Sash Zats","photo":"https://s.gravatar.com/avatar/f4287f42329751d778ac8a869cff3c48?s=80","url":"http://altconf.com/17/speakers/b07636c7ec0ae25bf0cb2751dd85fb3e8654b443","organization":null,"position":null,"biography":"Upon graduation with a masters in metallurgy, I decided to pursue a career in design, where over time, through animation, I slowly got into programming. At first web, Flash and Processing, and later for various Apple platforms. I've been working with Cocoa and Cocoa Touch for the past 8 years. I also tried to keep my design perspective throughout my career. Half a year ago I joined News Feed Delight team at Facebook. We're aiming to help users to discover and enjoy various features, and products within Facebook in playful and interactive way.","sessions":[{"id":"b07636c7ec0ae25bf0cb2751dd85fb3e8654b443","title":"Taking control of animations"}],"links":[]},{"id":"98a8e371e74852127ce3b05c2e5d17805345387c","name":"Stuart Hall","photo":"https://s.gravatar.com/avatar/5543d66f51a808ba280cc2fd79944388?s=80","url":"http://altconf.com/17/speakers/98a8e371e74852127ce3b05c2e5d17805345387c","organization":null,"position":null,"biography":"Stuart has been involved in mobile since the early days of the App Store as a developer, blogger and entrepreneur. He is currently co-founder and CEO of Appbot. In a single night, he built the 7 Minute Workout app, then blogged the story of growing the app to 2.3 million downloads before exiting to a large fitness device company. Previously he was a co-founder of Filter Squad who built the Discovr series of iOS applications which achieved over 4 million downloads.","sessions":[{"id":"98a8e371e74852127ce3b05c2e5d17805345387c","title":"How I got 2.3 million app downloads"}],"links":[]},{"id":"f14286e10f6b1f88ef64cee595903e2f10ee23a5","name":"Yusuke Kita","photo":null,"url":"http://altconf.com/17/speakers/f14286e10f6b1f88ef64cee595903e2f10ee23a5","organization":null,"position":null,"biography":"I’m an iOS developer at Mercari in San Francisco. I've been working on internationalization of Mercari app in iOS team. I'm passionate about learning new technology in iOS. When not coding, you can find me cycling.","sessions":[{"id":"f14286e10f6b1f88ef64cee595903e2f10ee23a5","title":"Type-safe Web APIs with Protocol Buffers in Swift"}],"links":[]},{"id":"37f3baafa1352b3a0ea0c7c6c2645893ea1b4753","name":"Udi Lumnitz","photo":null,"url":"http://altconf.com/17/speakers/37f3baafa1352b3a0ea0c7c6c2645893ea1b4753","organization":null,"position":null,"biography":"Leading the developer's community at Applicaster, building a platform that enables broadcasters and media companies to create an app without a developer's hand.\niOS developer since day 1, writing code in Swift, Objective-C & JavaScript, experience leading R&D teams in several startups over the years.","sessions":[{"id":"37f3baafa1352b3a0ea0c7c6c2645893ea1b4753","title":"Run your R&D as a community"}],"links":[]},{"id":"1529bbe3371a063e6ee47405ca3394b0e62319a6","name":"Manu Rink","photo":null,"url":"http://altconf.com/17/speakers/1529bbe3371a063e6ee47405ca3394b0e62319a6","organization":null,"position":null,"biography":"Manu Rink is a mobile enthusiast long before there was an iPhone. After working for a couple of years in the enterprise business and creating big data visualisations she finally dropped the mic and made her passion to her profession. For the last four years Manu was working as a mobile software engineer and architect and led the development of a couple of #1 App Store apps. Since 2016 she is a technical evangelist @Microsoft and inspires a wide audience of techies for her beloved topics including mobile development, devops and gaming.","sessions":[{"id":"1529bbe3371a063e6ee47405ca3394b0e62319a6","title":"\"The secret life of types in Swift\""}],"links":[]}],"sessions":[{"id":"c2d639a2d9f0f0ba317086c620fcc91668c5f45e","title":"AltConf Welcome","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/c2d639a2d9f0f0ba317086c620fcc91668c5f45e","begin":"2017-06-05T09:45:00-07:00","end":"2017-06-05T10:00:00-07:00","duration":15.0,"day":{"id":"2017-06-05","date":"2017-06-05","label_de":"Monday","label_en":"Monday","type":"day"},"location":{"id":"theater-15","label_en":"Theater 15","label_de":"Theater 15"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"bb8a10a3117dad22a4f64f7b226915661176cbc9","title":"Apple Keynote Breakfast","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/bb8a10a3117dad22a4f64f7b226915661176cbc9","begin":"2017-06-05T10:00:00-07:00","end":"2017-06-05T12:00:00-07:00","duration":120.0,"day":{"id":"2017-06-05","date":"2017-06-05","label_de":"Monday","label_en":"Monday","type":"day"},"location":{"id":"theater-15","label_en":"Theater 15","label_de":"Theater 15"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"5cac875f1f8c6d8d556293f8ec6b12335963e687","title":"Apple Keynote Panel Discussion (, ...)","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/5cac875f1f8c6d8d556293f8ec6b12335963e687","begin":"2017-06-05T13:00:00-07:00","end":"2017-06-05T14:15:00-07:00","duration":75.0,"day":{"id":"2017-06-05","date":"2017-06-05","label_de":"Monday","label_en":"Monday","type":"day"},"location":{"id":"theater-15","label_en":"Theater 15","label_de":"Theater 15"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"1f17c9026586ed577bc9f173c6fee91ed940ccc7","title":"Apple SOTU","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/1f17c9026586ed577bc9f173c6fee91ed940ccc7","begin":"2017-06-05T14:30:00-07:00","end":"2017-06-05T16:45:00-07:00","duration":135.0,"day":{"id":"2017-06-05","date":"2017-06-05","label_de":"Monday","label_en":"Monday","type":"day"},"location":{"id":"theater-15","label_en":"Theater 15","label_de":"Theater 15"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"6d2555ff148fbf8d7fe688867c6d21544fc51e0a","title":"ATP  Live","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/6d2555ff148fbf8d7fe688867c6d21544fc51e0a","begin":"2017-06-05T17:00:00-07:00","end":"2017-06-06T02:30:00+02:00","duration":30.0,"day":{"id":"2017-06-05","date":"2017-06-05","label_de":"Monday","label_en":"Monday","type":"day"},"location":{"id":"theater-15","label_en":"Theater 15","label_de":"Theater 15"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"b1aa5fea14cab8ecd41a05484abfa64788a4b505","title":"Is it too late to learn how to program and how being a developer change my life","subtitle":null,"abstract":"I will talk about how and why I wanted to be an iOS mobile developer at the age of 51. How a 16 year inspire me to learn to code and the challenges I face after becoming an iOS developer being the first self taught African American woman mobile developer to create a domestic violence app dedicated to helping victims escape abuse and how Apple found me and highlight me at WWDC 2015 and 2016 keynote event.  Some people want to believe that people my age are out of touch with technology and as a woman with that being said we the tech community need to change how we support each other.","description":null,"url":"https://altconf.com/17/sessions/b1aa5fea14cab8ecd41a05484abfa64788a4b505","begin":"2017-06-06T09:00:00-07:00","end":"2017-06-06T09:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"b1aa5fea14cab8ecd41a05484abfa64788a4b505","name":"Alicia Carr"}]},{"id":"6fce9ab0caba096f65444543364b8e63c30111c2","title":"Mastering Mobile SEO for Your Website & Native App","subtitle":null,"abstract":"Native apps account for 3 out of 4 minutes people spent on mobile devices. However, SEO practices are still largely focused on optimizing mobile websites, leaving app content out of this critical channel for content discovery and engagement. \n\nIn this talk, Mada from Branch will share best practices with app indexing and proven tactics to use app content to drive engagement and ranking boost from organic Google search.","description":null,"url":"https://altconf.com/17/sessions/6fce9ab0caba096f65444543364b8e63c30111c2","begin":"2017-06-06T10:00:00-07:00","end":"2017-06-06T10:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"6fce9ab0caba096f65444543364b8e63c30111c2","name":"Mada Seghete"}]},{"id":"fa891efab3d652f02dc00509779b5ad7d4d10c20","title":"MS 30/BuddyB 10","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/fa891efab3d652f02dc00509779b5ad7d4d10c20","begin":"2017-06-06T11:00:00-07:00","end":"2017-06-06T11:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"37f3baafa1352b3a0ea0c7c6c2645893ea1b4753","title":"Run your R&D as a community","subtitle":null,"abstract":"At Applicaster we don't have VP R&D, we don't have iOS/Android teams, we don't have managers. We have around 30 developers around the world acting as a community while building a platform for creating native media apps without developers hands and becoming the dominant mobile apps platform for the TV world.\n\nIn this session I will talk show how we do it, what was our challenges that lead us to the community approach, what are the challenges working this way and which tools we build in order to enable it.\n\nWe will talk about how we combine organization structure,  continuous integration (CI), \"native pluggable architecture\", app management service and bots in order to enable this beauty.\n\nIt will be fun and enlightening :)","description":null,"url":"https://altconf.com/17/sessions/37f3baafa1352b3a0ea0c7c6c2645893ea1b4753","begin":"2017-06-06T13:00:00-07:00","end":"2017-06-06T13:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"37f3baafa1352b3a0ea0c7c6c2645893ea1b4753","name":"Udi Lumnitz"}]},{"id":"cd61a2eabbaba1d31a73b1eda29d6eaa52cb3153","title":"Firebase/Fabric","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/cd61a2eabbaba1d31a73b1eda29d6eaa52cb3153","begin":"2017-06-06T14:00:00-07:00","end":"2017-06-06T14:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"e7d75f0a1db1e091c9e963b2f532e446a22b4022","title":"By Zeus! Become an Application God with Serverless Swift","subtitle":null,"abstract":"In April, Meyume Ltd released \"Weather Gods\": an app that enables users to receive custom, personalised, push notifications about the weather. As well as providing rich visualisations, graphics and audio allowing you to see hear and feel the weather, Weather Gods is unique in being built using an fully Serverless backend and being written entirely in Swift.\nIn this session we'll introduce you to Serverless, how to build serverless backends in Swift, and show you how the Weather Gods app was built.","description":null,"url":"https://altconf.com/17/sessions/e7d75f0a1db1e091c9e963b2f532e446a22b4022","begin":"2017-06-06T15:00:00-07:00","end":"2017-06-06T15:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"e7d75f0a1db1e091c9e963b2f532e446a22b4022","name":"Ian Partridge"}]},{"id":"f14286e10f6b1f88ef64cee595903e2f10ee23a5","title":"Type-safe Web APIs with Protocol Buffers in Swift","subtitle":null,"abstract":"Apple recently open sourced swift-protobuf which is a plugin of Protocol Buffers for swift language. Protocol Buffers are new serialization format which enables us to have type safety, make web APIs faster and consistent schema of structured data. JSON used to be a reasonable way in most cases, but Protocol Buffers could be another option if we consider these benefits.\n\nIn this talk, we'll discover examples of usage with swift-protobuf in cliant/server apps and I will also highlight major benefits and pros and cons based on my knowledge and experiences.","description":null,"url":"https://altconf.com/17/sessions/f14286e10f6b1f88ef64cee595903e2f10ee23a5","begin":"2017-06-06T16:00:00-07:00","end":"2017-06-06T16:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"f14286e10f6b1f88ef64cee595903e2f10ee23a5","name":"Yusuke Kita"}]},{"id":"6b5042c80a2810fc980548ac1f6c29efb30f5075","title":"Greg Raiz","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/6b5042c80a2810fc980548ac1f6c29efb30f5075","begin":"2017-06-06T09:00:00-07:00","end":"2017-06-06T09:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"412887d8745ae26852c7c4e5bff6278b21adb0e2","title":"Taming the Massive Controllers","subtitle":null,"abstract":"iOS development architecture is based on the MVC pattern (Model-View-Controller). MVC allows for separation of concerns, with the controller being responsible for orchestrating the flow of the application. Unfortunately, many times the controller becomes the point of neglect, and grows out of control.\n\nIn this session, you’ll discover how to tame the massive beast: the controller. Together, we’ll start with an out-of-control controller and work our way around to making it light and lean.\n\nThis session involves live coding with a minimal slide deck.","description":null,"url":"https://altconf.com/17/sessions/412887d8745ae26852c7c4e5bff6278b21adb0e2","begin":"2017-06-06T10:00:00-07:00","end":"2017-06-06T10:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"412887d8745ae26852c7c4e5bff6278b21adb0e2","name":"Mohammad Azam"}]},{"id":"f4fe312e75aeaa4d8e92f9dfa62df202bf7d6207","title":"Make Your Apps China-Friendly","subtitle":null,"abstract":"Our team at Booking.com focuses on optimizing East Asian markets. In first 1-2 slides, I will explain why Chinese market is important. Then I will talk about the trends in Chinese apps now, and how they are different from other countries. After this, there will be more tech side about how to leverage iOS APIs and Swift to internationalize your apps, topics includes QR codes, how to locale in a String-less way in Swift, adaptive UI with Auto Layout, etc.","description":null,"url":"https://altconf.com/17/sessions/f4fe312e75aeaa4d8e92f9dfa62df202bf7d6207","begin":"2017-06-06T11:00:00-07:00","end":"2017-06-06T13:00:00-07:00","duration":120.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"f4fe312e75aeaa4d8e92f9dfa62df202bf7d6207","name":"Guanshan Liu"}]},{"id":"188a677bbd2e5b24b41be96ca8f5fe8ad85c1e63","title":"Thirteen Ways Of Looking At A View Controller","subtitle":null,"abstract":"View controllers: we know them, love them, despise them, and overload them. As iOS developers, we struggle with the balance of maintaining small components against the complexity of our applications. While we know massive view controllers are bad, they’re so easy to write! In this session, we’ll explore the various uses and abuses of view controllers in search of a better way of structuring our applications.\n\nWould love to make this a half-sized ~22 minute session, but the topic is big enough to fill 45 minutes if need be.","description":null,"url":"https://altconf.com/17/sessions/188a677bbd2e5b24b41be96ca8f5fe8ad85c1e63","begin":"2017-06-06T13:00:00-07:00","end":"2017-06-06T13:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"188a677bbd2e5b24b41be96ca8f5fe8ad85c1e63","name":"Greg Heo"}]},{"id":"d2bb8a8ab787ea7dcbeb04db17995f5db73c2511","title":"How to Make Your App Better with A/B Testing on Firebase","subtitle":null,"abstract":"A/B testing. It's like flossing; everybody knows they ought to be doing it, but nobody does it as much as they should. And that's because it's kind of a pain -- setting up a proper A/B test requires setting up your app so that it can run these tests, making sure you're delivering the right variations to the right groups of users, accurately measuring those results, and drawing the right conclusions. It requires a fair amount of work, and maybe a background in Bayesian statistics. But with some of the new features Firebase has added to its platform, this process is now a bit easier. Come on by this presentation, and we'll show you how to set up your app so that you can easily change values on the fly, how to kick off an A/B test to experiment on some new change, and how to measure and interpret the results in ways that will make your app better. There will be live coding, some color-changing buttons, and maybe even some graphs! So swing on by; it’s sure to be a gasp-a-minute thrill ride! \n\nYou're still on your own with the flossing, though.","description":null,"url":"https://altconf.com/17/sessions/d2bb8a8ab787ea7dcbeb04db17995f5db73c2511","begin":"2017-06-06T14:00:00-07:00","end":"2017-06-06T14:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"d2bb8a8ab787ea7dcbeb04db17995f5db73c2511","name":"Todd Kerpelman"}]},{"id":"aa9b5ee2c43a021207480d8aeb3fcd25f7f3beb8","title":"Why the Func","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/aa9b5ee2c43a021207480d8aeb3fcd25f7f3beb8","begin":"2017-06-06T15:00:00-07:00","end":"2017-06-06T15:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"aa9b5ee2c43a021207480d8aeb3fcd25f7f3beb8","name":"Daniel Steinberg"}]},{"id":"2bfa00ad9eadb3c394a42c46ee102659e7b22c3e","title":"Industry Report: Mac Developers Survey Results","subtitle":null,"abstract":" - Choosing the Marketplace\n - App distribution channels\n - Selling via the Mac App Store\n     - 30% revenue share\n     - App Store limitations\n\n - Selling outside the Mac App Store\n    - reasons developers leave\n    - what it takes to sell an app\n    - making your own distribution tools\n    - \n - Challenges developers face and the solutions they find\n - and much more.\n\nThe answers to these questions were collected via an annual Mac Developer Survey: 700+ developers responded to it. Come and see what the market is now compared to a year ago, and what's coming.\nHere is last year's report: http://devmate.com/mac-dev-survey. ","description":null,"url":"https://altconf.com/17/sessions/2bfa00ad9eadb3c394a42c46ee102659e7b22c3e","begin":"2017-06-06T16:00:00-07:00","end":"2017-06-06T16:45:00-07:00","duration":45.0,"day":{"id":"2017-06-06","date":"2017-06-06","label_de":"Tuesday","label_en":"Tuesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"2bfa00ad9eadb3c394a42c46ee102659e7b22c3e","name":"Yaroslav Stepanenko"}]},{"id":"1be81fbb73902881a44e40563a29e50f7d1d004a","title":"The Reality of Indie Life","subtitle":null,"abstract":"Being an \"independent worker\" is the dream of many in our community but when I made the jump and left my job in the fall of 2015, I quickly found that working for myself full time wasn't as easy as I had assumed it would be. I had a bunch of expectations that I had to work through, and ended up being depressed several month into it. Slowly but surely I worked through this, and have come out the other side stronger and wanting to help people who are indie or are thinking about it ","description":null,"url":"https://altconf.com/17/sessions/1be81fbb73902881a44e40563a29e50f7d1d004a","begin":"2017-06-07T09:00:00-07:00","end":"2017-06-07T09:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"1be81fbb73902881a44e40563a29e50f7d1d004a","name":"Stephen Hackett"}]},{"id":"af5efcfa025c908062b65c7f0b9cb2be3c6e9b18","title":"Kickstarting your app with user feedback","subtitle":null,"abstract":"Breaker is an iOS app for listening to podcasts, built on user feedback. The app started with just a handful of TestFlight beta testers while the team iterated on the product for over 6 months. Within two weeks of launching, Breaker quickly grew to over 10k users with fantastic early retention. By adding implicit metrics tracking as well as tools for users to easily send feedback, the Breaker team were able to quickly understand and respond to users' needs. In this session, Leah will discuss the three most important tools Breaker uses to understand user behavior as well as the team's process for determining new features, based on lessons learnt from Y Combinator.","description":null,"url":"https://altconf.com/17/sessions/af5efcfa025c908062b65c7f0b9cb2be3c6e9b18","begin":"2017-06-07T10:00:00-07:00","end":"2017-06-07T10:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"af5efcfa025c908062b65c7f0b9cb2be3c6e9b18","name":"Leah Culver"}]},{"id":"c52b61d07890714a952194436cc05a17b276d6a0","title":"What making Records taught me about writing code","subtitle":null,"abstract":"I used to make records.  Now I make apps.  Turns out they aren't really all that different.  \n\nExcept one is louder.\n\nEver wondered if there is any other career that is similar to programming?  Curious how making records may or may not related to coding?  Interested in seeing lots of pictures on a big screen while someone describes what they are?  Then this is the talk for you.  I spent 25 years making things louder and learned a few things along the way.  This talk goes over some of the obvious (and not so obvious) lessons I learned in audio that are applicable to writing software (or any other creative/technical endeavor).  \nNote:  This is less of a technical and more of an inspiration talk.\n","description":null,"url":"https://altconf.com/17/sessions/c52b61d07890714a952194436cc05a17b276d6a0","begin":"2017-06-07T11:00:00-07:00","end":"2017-06-07T11:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"c52b61d07890714a952194436cc05a17b276d6a0","name":"James Majors"}]},{"id":"d76229725545bd69dc7b3b4f69c70163ed61d3c6","title":"The Future of Tech is Sustainable, Diverse & Makes a Difference","subtitle":null,"abstract":"To survive and grow, technology companies need to align themselves with, and invest in, sustainability, diversity, inclusion and social impact.\n\nDrawing on the United Nations' 17 Sustainable Development Goals, research by Ernst & Young, The Boston Consulting Group, and others, I will make the case that companies not aligned with these goals will lack the resilience and strength to face the challenges that lie ahead—from competitors, from the environment, and from the workforce.\n\nFinally, we will look at some positive examples and talk about what the next steps for your company, startup, or other organisation/conference/meetup might be.\n\nTech companies are well placed to make this transition. As an industry, as well as software and hardware we have experience with disruptive innovation and have learnt how to apply lean and agile methodologies to new industries. People from Clayton Christensen to Bill Gates believe these are keys to resilience and impact in all sectors.\n\nWhen you're making your dent in the universe, make it count and make it last.\n\nNB: Target audience spans business, product, ethics and really everyone!","description":null,"url":"https://altconf.com/17/sessions/d76229725545bd69dc7b3b4f69c70163ed61d3c6","begin":"2017-06-07T13:00:00-07:00","end":"2017-06-07T13:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"d76229725545bd69dc7b3b4f69c70163ed61d3c6","name":"Mark Aufflick"}]},{"id":"c8c36a3ae648da44213ca8e9098b99dce10895f4","title":"Enterprise Swift Services: A Recipe for Deployment into Production","subtitle":null,"abstract":"Is server side Swift ready for production? Has it shown its potential in a true, enterprise production environment? \n\nIt’s been a little over 1 year since Apple open sourced Swift to Github and opened the door for both client and server engineers to leverage a new platform. Since then, there have been hundreds of advancements in the language, runtime, and ecosystem tools that have enabled developers to adopt Swift in new and interesting ways. \n\nDespite Apple’s sponsorship of Swift, when you work at a large bank, the reliability of any new tool is still under intense scrutiny. I’m excited to show you our recipe for creating fault tolerant and production ready Experience APIs, for our flagship mobile products, leveraging Swift.\n\nSpecifically, I’ll walk you through how we evaluated Swift as a tool for our services’ needs, how we structured our enterprise architecture using Swift, as well as how we used tools from Netflix and Docker to enable fault tolerance, isolation, and ease of deployment.\n\nThis talk is geared toward technologists who are generally interested in an approach for adopting new technologies in the enterprise, and specifically, for the server side Swift skeptics out there.","description":null,"url":"https://altconf.com/17/sessions/c8c36a3ae648da44213ca8e9098b99dce10895f4","begin":"2017-06-07T14:00:00-07:00","end":"2017-06-07T14:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"c8c36a3ae648da44213ca8e9098b99dce10895f4","name":"Tripta Gupta"}]},{"id":"e3b18cf66e32d2568591b9d363d48f990be2d43b","title":"Nandini,Pim","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/e3b18cf66e32d2568591b9d363d48f990be2d43b","begin":"2017-06-07T15:00:00-07:00","end":"2017-06-07T15:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"ae8c96c72f478ee12e26dea01f20c2431c84a506","title":"What Google learned about building smooth animation in our iOS apps","subtitle":null,"abstract":"Animation is important! With just a few moving objects, you can convey complicated relationships between views or completely separate view controllers. But animation is also hard! Okay, maybe some animation is easy. But when it comes to animation that’s smooth and jank-free, can respond to your users actions, and is easy to debug, it’s harder than you might think. Come learn about some of the problems Google apps encountered when trying to add more animations to their apps, and how they were able to address many of these issues with a set of open source tools.","description":null,"url":"https://altconf.com/17/sessions/ae8c96c72f478ee12e26dea01f20c2431c84a506","begin":"2017-06-07T16:00:00-07:00","end":"2017-06-07T16:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"ae8c96c72f478ee12e26dea01f20c2431c84a506","name":"Jeff Verkoeyen"}]},{"id":"8836e323d972a8e97304193d0a5be0ffb0becd40","title":"Build That App","subtitle":null,"abstract":"The theme of my channel and website is to learn application building through the process of breaking down well known applications and reconstructing them.  Having grown a huge audience over the past year, I can provide insight into the different approaches I've taken to teach everyone how to code.  The huge distinction between my tutorials and others is the fact that I do everything programmatically.  Not only is this a different approach to the whole thing, it has opened the minds of many beginners getting their feet wet in iOS dev.","description":null,"url":"https://altconf.com/17/sessions/8836e323d972a8e97304193d0a5be0ffb0becd40","begin":"2017-06-07T09:00:00-07:00","end":"2017-06-07T09:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"8836e323d972a8e97304193d0a5be0ffb0becd40","name":"Brian Voong"}]},{"id":"0ee1d277b04879f0ba6263598d9e2f10f94e98f8","title":"It's Ok, No One Knows Anything","subtitle":null,"abstract":"When I tell people what I do for a living, they tend to respond \"wow you must be smart\" — my shameful secret is, like most other developers, eh, not especially. I just know how to figure things out, and am interested in doing so. I'd like to encourage other people who are interested in a career as a developer but are scared that they're not \"smart\" enough (whatever that means), or don't have the right background (my fellow English majors, represent!), or are otherwise hopelessly unqualified to pursue one — I'll let them in on the secret that we all basically Google things all day long, and that's totally fine.","description":null,"url":"https://altconf.com/17/sessions/0ee1d277b04879f0ba6263598d9e2f10f94e98f8","begin":"2017-06-07T10:00:00-07:00","end":"2017-06-07T10:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"0ee1d277b04879f0ba6263598d9e2f10f94e98f8","name":"Jessica Dennis"}]},{"id":"0a932c8c023068606eb22077c844e497274d2794","title":"Challenging Your Assumptions","subtitle":null,"abstract":"“Well, most users will have 3D touch by the next iPhone”\n“I doubt many visually impaired people even use our product anyway”\n“Sarah didn’t say anything during our meeting so she doesn’t seem to have an opinion on the architecture design”\n“Don’t worry, users will get it once they use it”\n\nAs developers we make assumptions every day. However as Alan Alda stated “Your assumptions are your windows on the world. Scrub them off every once in awhile, or the light won't come in.” Whether it is about your users or your teammates, our perceived thoughts drive how we approach software development - for better or worse. This talk will walk through some of the most common assumptions iOS engineers encounter and discuss ways we can learn to think more inclusively when it comes to both feature and app development, as well as within our own teams. We’ll also cover some strategies on how to keep an open mind when approaching these kinds of topics.\n\n(I'm also willing to do a shortened version of this talk and split the time with another speaker)\n","description":null,"url":"https://altconf.com/17/sessions/0a932c8c023068606eb22077c844e497274d2794","begin":"2017-06-07T11:00:00-07:00","end":"2017-06-07T13:00:00-07:00","duration":120.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"0a932c8c023068606eb22077c844e497274d2794","name":"Kristina Thai"}]},{"id":"b92348c6f7bd2ac61080f9844622ba51b1d275ba","title":"IBM 30/iMazing 10","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/b92348c6f7bd2ac61080f9844622ba51b1d275ba","begin":"2017-06-07T13:00:00-07:00","end":"2017-06-07T13:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"5196e70c12c00ac22440b7dee6ce4b91cd31cf18","title":"Finally, Automation Magic for both iOS and macOS","subtitle":null,"abstract":"The dream of automation between iOS and macOS has remained elusive for years. Until now. Find out how The Omni Group has taken an alternative approach, based on JavaScript Core, to automate Omni's suite of productivity applications for macOS and iOS with real, object-model scripting support comparable to the traditional automation tools of OS X.\n\nLearn how OmniJS enables true “write-once” cross-platform automation, delivered through plugins, libraries, menus and user-assigned action triggers. Find out how its JavaScript lineage leads OmniJS to seamlessly integrate with the classic JavaScript DOM, and how a tap can trigger transfer and manipulation of data into an Omni app document.\n\nJoin Sal Soghoian for an overview of the next step in Automation, and bring your Macbook and/or iPad. OmniJS sparkles on both!","description":null,"url":"https://altconf.com/17/sessions/5196e70c12c00ac22440b7dee6ce4b91cd31cf18","begin":"2017-06-07T14:00:00-07:00","end":"2017-06-07T14:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"5196e70c12c00ac22440b7dee6ce4b91cd31cf18","name":"Sal Soghoian"}]},{"id":"1529bbe3371a063e6ee47405ca3394b0e62319a6","title":"\"The secret life of types in Swift\"","subtitle":null,"abstract":"We loved playgrounds in our childhood and most of us still want to jump onto a swing when walking by one. With the Swift Playgrounds it's just that easy to start playing again and even better - to share your own playground with the people out there who are as enthusiastic about coding as you are.\n\nThis talk gives a basic introduction into the Swift Playgrounds on the one hand and how you can teach like-minded people out there to code by telling an \"emotional\" story with the Microsoft Cognitive Services APIs on the other hand.","description":null,"url":"https://altconf.com/17/sessions/1529bbe3371a063e6ee47405ca3394b0e62319a6","begin":"2017-06-07T15:00:00-07:00","end":"2017-06-07T15:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"1529bbe3371a063e6ee47405ca3394b0e62319a6","name":"Manu Rink"}]},{"id":"cd84e7ed0255efd67250a0ab6367044044fb75f1","title":"Continuous everything  for iOS apps","subtitle":null,"abstract":"In this session, you will learn how to build, test, deploy and distribute your app directly to your users on every commit. Ship bugfixes for your app without resubmitting to the app store. The tools for continuous integration and delivery are improving as fast as the mobile market itself. Combined with platforms to monitor the quality and usage of your app, a powerful Mobile DevOps workflow is evolving. Join us to learn more about the available free and commercial CI/CD popular tools and how to tie automated builds, tests, and releases together in a single workflow.  ","description":null,"url":"https://altconf.com/17/sessions/cd84e7ed0255efd67250a0ab6367044044fb75f1","begin":"2017-06-07T16:00:00-07:00","end":"2017-06-07T16:45:00-07:00","duration":45.0,"day":{"id":"2017-06-07","date":"2017-06-07","label_de":"Wednesday","label_en":"Wednesday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"cd84e7ed0255efd67250a0ab6367044044fb75f1","name":"Simina Pasat"}]},{"id":"03273d7c303cd6caa5a45a1fea46332ccab6c33d","title":"A app for a presidential election !","subtitle":null,"abstract":"From Sept. 2016 to June 2017, the face of the world has/will change(d). USA have elect Mr. D. Trump, French people will chose their next president in April 27. and May 7, and so will Germany in September. \n\nSince August I've engaged myself in politics, here, in France (whatever the political party, be sure it's not a populist one) locally in my department heading the digital and tech stuff, and nationally, developing the official iOS app for the movement.\n\nDuring this 45 min talk, i'll describe the process we set up in order to reach a much people as possible, young, old, men, women thought A/B testing, reporting and we'll discuss the result (I'm not a soothsayer, but AltConf is held after the election 😀) and how, afterwards we could have increase it's potential. \n\nIt's not a technical talk, the app itself isn't \"complicated\" but we've seen a huge engagement around it, and nowadays, you won election on the street, like 40 years before, but also on iPhones, and social networks.","description":null,"url":"https://altconf.com/17/sessions/03273d7c303cd6caa5a45a1fea46332ccab6c33d","begin":"2017-06-08T10:00:00-07:00","end":"2017-06-08T10:45:00-07:00","duration":45.0,"day":{"id":"2017-06-08","date":"2017-06-08","label_de":"Thursday","label_en":"Thursday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"03273d7c303cd6caa5a45a1fea46332ccab6c33d","name":"Clément SAUVAGE"}]},{"id":"98a8e371e74852127ce3b05c2e5d17805345387c","title":"How I got 2.3 million app downloads","subtitle":null,"abstract":"I can present my journey of starting with the simplest possible app and growing it to 2.3m downloads and eventual acquisition. You can read the text version at https://stories.appbot.co/how-i-got-2-3m-app-downloads-without-spending-a-cent-on-marketing-f4823b6bc779 that's had almost 400k reads and was one of Mediums most read articles of 2015.","description":null,"url":"https://altconf.com/17/sessions/98a8e371e74852127ce3b05c2e5d17805345387c","begin":"2017-06-08T11:00:00-07:00","end":"2017-06-08T11:45:00-07:00","duration":45.0,"day":{"id":"2017-06-08","date":"2017-06-08","label_de":"Thursday","label_en":"Thursday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"98a8e371e74852127ce3b05c2e5d17805345387c","name":"Stuart Hall"}]},{"id":"c102a51373dbaf7fb42f2410cf818cda379d0f29","title":"Name your thing! (Subject to change)","subtitle":null,"abstract":"This talk will discuss various strategies and pitfalls for naming all kinds of projects, from tiny side podcasts to major business products.","description":null,"url":"https://altconf.com/17/sessions/c102a51373dbaf7fb42f2410cf818cda379d0f29","begin":"2017-06-08T13:00:00-07:00","end":"2017-06-08T13:45:00-07:00","duration":45.0,"day":{"id":"2017-06-08","date":"2017-06-08","label_de":"Thursday","label_en":"Thursday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"c102a51373dbaf7fb42f2410cf818cda379d0f29","name":"Virginia Roberts"}]},{"id":"0ee1d277b04879f0ba6263598d9e2f10f94e98f8","title":"Jessica Dennis","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/0ee1d277b04879f0ba6263598d9e2f10f94e98f8","begin":"2017-06-08T14:00:00-07:00","end":"2017-06-08T14:45:00-07:00","duration":45.0,"day":{"id":"2017-06-08","date":"2017-06-08","label_de":"Thursday","label_en":"Thursday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"0ee1d277b04879f0ba6263598d9e2f10f94e98f8","name":"Jessica Dennis"}]},{"id":"887d6d18a4dd3e1996db355469967b67204b0bc4","title":"Twilio 10\nJames Dempsey","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/887d6d18a4dd3e1996db355469967b67204b0bc4","begin":"2017-06-08T15:00:00-07:00","end":"2017-06-08T15:45:00-07:00","duration":45.0,"day":{"id":"2017-06-08","date":"2017-06-08","label_de":"Thursday","label_en":"Thursday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"fedafc05b8736a68ddabb02c3c51685cc1a80cb2","title":"?","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/fedafc05b8736a68ddabb02c3c51685cc1a80cb2","begin":"2017-06-08T16:00:00-07:00","end":"2017-06-08T16:45:00-07:00","duration":45.0,"day":{"id":"2017-06-08","date":"2017-06-08","label_de":"Thursday","label_en":"Thursday","type":"day"},"location":{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"dbe1765f11b96bd6f443c763a0782be085b5878b","title":"Swift Things: Programming the Internet of Things with Swift","subtitle":null,"abstract":"The Swift programming language is now open-source. Therefore, the time has come to see where else Swift can be used beyond the Apple ecosystem. While IBM has taken Swift to the data center, in this talk my colleague Laurie Hannon and I present our adventures taking Swift the other way--to the very small devices of the Internet of Things (IoT). Does Swift run on an inexpensive microcontroller running with a clock of just 48 MHz and only 20 kilobytes of RAM running on a coin-cell battery designed to power the computer for a year? Attendees of this session get to discover the answer as we hack through bare-metal details behind Swift and the LLVM compiler suite on which it’s built. And why even bother with Swift on tiny IoT computers? As we present our findings, we’ll discuss some of the reasons why Swift (and Rust!) on constrained hardware might actually be a good idea.","description":null,"url":"https://altconf.com/17/sessions/dbe1765f11b96bd6f443c763a0782be085b5878b","begin":"2017-06-08T10:00:00-07:00","end":"2017-06-08T10:45:00-07:00","duration":45.0,"day":{"id":"2017-06-08","date":"2017-06-08","label_de":"Thursday","label_en":"Thursday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"dbe1765f11b96bd6f443c763a0782be085b5878b","name":"Steven Gray"}]},{"id":"b07636c7ec0ae25bf0cb2751dd85fb3e8654b443","title":"Taking control of animations","subtitle":null,"abstract":"With Apple spending years on promoting fire-and-forget API for animations, it's important to step back and reconsider when to use these and when it's crucial to have more control over lifecycle of animation.\nThis talk explores reasons for you to want to have better control over animations and how to achieve that. We'll cover following topics:\n• What are the options we have at our disposal when it comes to animating things on the screen?\n• When is it okay to use fire-and-forget animations and when is not?\n• How to animate in reactive / declarative systems such as ComponentKit (used extensively in Facebook's News Feed)?\n• Bag of tips and tricks allowing to take control over animations and achieve trulls astonishing results.","description":null,"url":"https://altconf.com/17/sessions/b07636c7ec0ae25bf0cb2751dd85fb3e8654b443","begin":"2017-06-08T11:00:00-07:00","end":"2017-06-08T13:00:00-07:00","duration":120.0,"day":{"id":"2017-06-08","date":"2017-06-08","label_de":"Thursday","label_en":"Thursday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"b07636c7ec0ae25bf0cb2751dd85fb3e8654b443","name":"Sash Zats"}]},{"id":"8140db8e1fb9bf038144a5df2c838b4c5160c3f1","title":"MS 30/Atlass 10","subtitle":null,"abstract":null,"description":null,"url":"https://altconf.com/17/sessions/8140db8e1fb9bf038144a5df2c838b4c5160c3f1","begin":"2017-06-08T13:00:00-07:00","end":"2017-06-08T13:45:00-07:00","duration":45.0,"day":{"id":"2017-06-08","date":"2017-06-08","label_de":"Thursday","label_en":"Thursday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[]},{"id":"0afb082526308768b0fc96b6183e1151e792c973","title":"Bringing Machine Learning to your iOS Apps 🤖📲","subtitle":null,"abstract":"Machine learning is a vast topic that it can seem daunting to get started. However, as app developers, we do not need to be experts to utilize the ML tools available to enhance our apps. \nUsing machine learning in our apps can help us better understand our users so that we can build a better product for them 🔨😎. This talk will cover:\n\n1. Brief overview of foundational ML concepts (neural networks, training, inference)\n2. Examples of how machine learning could help enhance your app and when it is practical\n3. Where training vs inference occur\n- training is computationally too expensive to do on device for now\n- inference can be done on device using pre-trained model\n- examples of architecture setups you can have for where training and inference are done (own machines vs cloud vs MLaaS provider vs device)\n4. What's currently available from Apple & 3rd parties + DEMO\n- Apple released 2 APIs, both using convolutional neural networks which are most suitable for describing objects in a given photo\n> Accelerate BNNS (*CPU*): Basic Neural Network Subroutines\n> MPSCNN (*GPU*): ⚡️ Metal ⚡️🤘 Performance Shader Convolutional Neural Networks\n- DEMO with code samples of how to use them \n- What the future may hold(!!). Apple hired many ML experts over the past year, acquired Turi, and started making their own GPUs, so it seems like they are heavily investing in this direction. During the week of AltConf / WWDC, new exciting advancements may come out, and I'd like to touch on how these can be utilized.\n5. Tools for learning more about ML\n- Resources for learning more about the different topics in ML, and an effective strategy to get there quickly (recommended blog posts, TWinML podcast, open source pre-trained models from TensorFlow and others, sample code, Stanford ML Coursera course for more theory background)","description":null,"url":"https://altconf.com/17/sessions/0afb082526308768b0fc96b6183e1151e792c973","begin":"2017-06-08T14:00:00-07:00","end":"2017-06-08T14:45:00-07:00","duration":45.0,"day":{"id":"2017-06-08","date":"2017-06-08","label_de":"Thursday","label_en":"Thursday","type":"day"},"location":{"id":"room-2","label_en":"Room 2","label_de":"Room 2"},"track":{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]},"lang":{"id":"en","label_de":"Englisch","label_en":"English"},"level":{"id":"advanced","label_de":"Advanced"},"speakers":[{"id":"0afb082526308768b0fc96b6183e1151e792c973","name":"Meghan Kane"}]}],"tracks":[{"id":"altconf","label_de":"AltConf","label_en":"AltConf","color":[0.082,0.678,0.239]}],"locations":[{"id":"theater-15","label_en":"Theater 15","label_de":"Theater 15"},{"id":"room-1","label_en":"Room 1","label_de":"Room 1"},{"id":"room-2","label_en":"Room 2","label_de":"Room 2"}]}